Table of Contents
 Class IdeaMember2D
Namespace
IdeaStatiCa.BimApiLink.BimApi
Assembly
IdeaStatiCa.BimApiLink.dll
public class IdeaMember2D : AbstractIdeaObject<IIdeaMember2D>, IEquatable<AbstractIdeaObject<IIdeaMember2D>>, IIdeaMember2D, IIdeaObjectConnectable, IIdeaPersistentObject, IIdeaObject
Inheritance
object
ScopeAwareObject
BimLinkObject
AbstractIdeaObject<IIdeaMember2D>
IdeaMember2D
Implements
IEquatable<AbstractIdeaObject<IIdeaMember2D>>
IIdeaMember2D
IIdeaObjectConnectable
IIdeaPersistentObject
IIdeaObject
Inherited Members
 AbstractIdeaObject<IIdeaMember2D>.Id
 AbstractIdeaObject<IIdeaMember2D>.Name
 AbstractIdeaObject<IIdeaMember2D>.Identifier
 AbstractIdeaObject<IIdeaMember2D>.GetHashCode()
 AbstractIdeaObject<IIdeaMember2D>.Equals(object)
 AbstractIdeaObject<IIdeaMember2D>.Equals(AbstractIdeaObject<IIdeaMember2D>)
 BimLinkObject.Get<T>(Identifier<T>)
 BimLinkObject.Get<T>(int)
 BimLinkObject.Get<T>(string)
 BimLinkObject.GetMaybe<T>(Identifier<T>)
 BimLinkObject.GetMaybe<T>(int)
 BimLinkObject.GetMaybe<T>(string)
 BimLinkObject.CountryCode
 BimLinkObject.UserData
 ScopeAwareObject.Scope
 object.ToString()
 object.Equals(object, object)
 object.ReferenceEquals(object, object)
 object.GetType()
 object.MemberwiseClone()
Constructors
 IdeaMember2D(Identifier<IIdeaMember2D>)
public IdeaMember2D(Identifier<IIdeaMember2D> identifer)
Parameters
identifer Identifier<IIdeaMember2D>
 IdeaMember2D(int)
public IdeaMember2D(int id)
Parameters
id int
 IdeaMember2D(string)
public IdeaMember2D(string id)
Parameters
id string
Properties
 Elements2D
List of Element2D
public virtual List<IIdeaElement2D> Elements2D { get; set; }
Property Value
List<IIdeaElement2D>
 Token
Persistence token. Holds data neccessery to recreated the object in future.
public virtual IIdeaPersistenceToken Token { get; set; }
Property Value
IIdeaPersistenceToken
 Edit this page